import asyncio
from sqlalchemy.ext.asyncio import create_async_engine, async_sessionmaker
from sqlalchemy import text

# Импорты
from app.core.config import settings
from app.models.place import Place
# Импортируем твою асинхронную функцию
from app.services.ml_service import get_embedding

PLACE_IMAGES ={}
TEST_PLACES = [
    # --- МОСКВА ---
    {
        "name": "Красная Площадь",
        "city": "Moscow",
        "type": "Музей",
        "price": "Бесплатно",
        "lat": 55.753930, "lon": 37.620795,
        "image_url": "http://localhost:8000/static/images/defautl_img_1.jpg",
        "description": "Сердце России, исторический центр Москвы с видом на Кремль и Собор Василия Блаженного.",
        "context": "Красная Площадь. Главная достопримечательность, история, прогулки, брусчатка, мавзолей Ленина, ГУМ, мороженое, сувениры, зима, каток, ярмарка, центр города."
    },
    {
        "name": "Парк Горького",
        "city": "Moscow",
        "type": "Парк",
        "price": "Бесплатно",
        "lat": 55.729462, "lon": 37.601323,
        "image_url": "http://localhost:8000/static/images/defautl_img_1.jpg",
        "description": "Главный парк столицы. Идеальное место для отдыха, спорта и пикников на набережной.",
        "context": "Парк Горького. Природа, деревья, набережная Москвы-реки, велосипеды, самокаты, прогулка с детьми, свидание, лето, отдых, пикник, катамараны. Есть еда, бургеры, кофе."
    },
    {
        "name": "Депо.Москва",
        "city": "Moscow",
        "type": "Кафе",
        "price": "Средний",
        "lat": 55.729462, "lon": 37.601323,
        "image_url": "http://localhost:8000/static/images/defautl_img_1.jpg",
        "description": "Крупнейший фудмолл в Европе. Гастрономический квартал в здании бывшего трамвайного депо.",
        "context": "Депо.Москва. Еда, рестораны, гастромаркет, фастфуд, высокая кухня, бар, коктейли, тусовка, завтрак, обед, ужин, встречи с друзьями, шумное место, много людей, вкусно поесть."
    },

    # --- САНКТ-ПЕТЕРБУРГ ---
    {
        "name": "Эрмитаж",
        "city": "Saint Petersburg",
        "type": "Музей",
        "price": "Средний",
        "description": "Один из величайших музеев мира в Зимнем дворце. Миллионы экспонатов искусства.",
        "context": "Эрмитаж. Искусство, картины, история, цари, дворец, культура, дождь (спрятаться от погоды), экскурсия, долго ходить, интересно, образование. Внутри есть кафе."
    },
    {
        "name": "Севкабель Порт",
        "city": "Saint Petersburg",
        "type": "Парк",
        "price": "Бесплатно",
        "description": "Модное пространство у моря на Васильевском острове. Вид на залив, выставки и бары.",
        "context": "Севкабель Порт. Море, Финский залив, закат, романтика, современное искусство, выставки, концерты, вечеринки, каток зимой, бары, стритфуд, молодежное место, хипстеры."
    },
    {
        "name": "Улица Рубинштейна",
        "city": "Saint Petersburg",
        "type": "Бар",
        "price": "Премиум",
        "description": "Главная ресторанная улица города. Барная линия с десятками заведений на любой вкус.",
        "context": "Улица Рубинштейна. Бары, алкоголь, вечеринка, ночь, рестораны, вкусная еда, знакомства, тусовка, прогулка, выпить, коктейли, музыка, центр."
    },

    # --- ОМСК ---
    {
        "name": "Skuratov Coffee (Флагман)",
        "city": "Omsk",
        "type": "Кафе",
        "price": "Средний",
        "description": "Родина знаменитых брю-баров. Стильный интерьер, отличный кофе и атмосфера для работы.",
        "context": "Skuratov Coffee (Флагман). Кофе, кофейня, завтрак, работа с ноутбуком, фриланс, спокойное место, вкусный десерт, круассаны, эйр латте, колд брю, встреча, уют."
    },
    {
        "name": "Омская Крепость",
        "city": "Omsk",
        "type": "Музей",
        "price": "Бесплатно",
        "description": "Исторический комплекс на берегу Иртыша. Восстановленные ворота и здания 18-19 веков.",
        "context": "Омская Крепость. История, достопримечательность, Иртыш, река, набережная, прогулки, экскурсии, Тобольские ворота, памятник, культура, центр города, фотосессия."
    },
    {
        "name": "Птичья Гавань",
        "city": "Omsk",
        "type": "Парк",
        "price": "Бесплатно",
        "description": "Природный парк в черте города. Озера, перелетные птицы и тишина.",
        "context": "Птичья Гавань. Природа, экология, парк, птицы, животные, тишина, спокойствие, прогулка с детьми, свежий воздух, озеро, осень, лето, наблюдение."
    }
]

async def seed_data():
    print("🚀 Начинаем наполнение базы данных...")
    
    engine = create_async_engine(settings.DATABASE_URL)
    SessionLocal = async_sessionmaker(engine, expire_on_commit=False)

    async with SessionLocal() as db:
        await db.execute(text("TRUNCATE TABLE places RESTART IDENTITY"))
        
        for data in TEST_PLACES:
            print(f"Adding: {data['name']}...")
            
            # Собираем текст
            text_for_vector = f"{data['description']} {data.get('context', '')}"
            
            # ВАЖНО: Добавили await, так как твоя функция async
            vector = await get_embedding(text_for_vector)
            
            place = Place(
                name=data["name"],
                city=data["city"],
                type=data["type"],
                price=data["price"],
                description=data["description"],
                lat=data.get("lat"), 
                lon=data.get("lon"), 
                image_url=data.get("image_url"), 
                search_context=text_for_vector,
                embedding=vector
            )
            db.add(place)
        
        await db.commit()
        print("✅ База данных успешно обновлена!")
    
    await engine.dispose()

if __name__ == "__main__":
    asyncio.run(seed_data())